IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_epwm_regs.xml
	<register id="VCNTCFG" width="16" page="1" offset="0x19" internal="0" description="Valley Counter Config Register">
		<bitfield id="STARTEDGE" description="Counter Start Edge Selection" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="STARTEDGESTS" description="Start Edge Status Bit " begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="STOPEDGE" description="Counter Start Edge Selection" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="STOPEDGESTS" description="Stop Edge Status Bit " begin="15" end="15" width="1" rwaccess="R"/>
	</register>
	<register id="HRCNFG" width="16" page="1" offset="0x20" internal="0" description="HRPWM Configuration Register">
		<bitfield id="EDGMODE" description="ePWMxA Edge Mode Select Bits" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CTLMODE" description="ePWMxA Control Mode Select Bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="HRLOAD" description="ePWMxA Shadow Mode Select Bits" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="SELOUTB" description="EPWMB Output Selection Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="AUTOCONV" description="Autoconversion Bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SWAPAB" description="Swap EPWMA and EPWMB Outputs Bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EDGMODEB" description="ePWMxB Edge Mode Select Bits" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="CTLMODEB" description="ePWMxB Control Mode Select Bits" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="HRLOADB" description="ePWMxB Shadow Mode Select Bits" begin="12" end="11" width="2" rwaccess="RW"/>
	</register>
	<register id="HRPWR" width="16" page="1" offset="0x21" internal="0" description="HRPWM Power Register">
		<bitfield id="CALPWRON" description="Calibration Power On" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="HRMSTEP" width="16" page="1" offset="0x26" internal="0" description="HRPWM MEP Step Register">
		<bitfield id="HRMSTEP" description="High Resolution Micro Step Value" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="HRCNFG2" width="16" page="1" offset="0x27" internal="0" description="HRPWM Configuration 2 Register">
		<bitfield id="EDGMODEDB" description="Dead-Band Edge-Mode Select Bits" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="CTLMODEDBRED" description="DBRED Control Mode Select Bits" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="CTLMODEDBFED" description="DBFED Control Mode Select Bits" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="HRPCTL" width="16" page="1" offset="0x2d" internal="0" description="High Resolution Period Control Register ">
		<bitfield id="HRPE" description="High Resolution Period Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PWMSYNCSEL" description="EPWMSYNCPER Source Select " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TBPHSHRLOADE" description="TBPHSHR Load Enable " begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PWMSYNCSELX" description="EPWMSYNCPER Extended Source Select Bit: " begin="6" end="4" width="3" rwaccess="RW"/>
	</register>
	<register id="TRREM" width="16" page="1" offset="0x2e" internal="0" description="Translator High Resolution Remainder Register">
		<bitfield id="TRREM" description="Translator Remainder Bits" begin="10" end="0" width="11" rwaccess="RW"/>
	</register>
	<register id="GLDCTL" width="16" page="1" offset="0x34" internal="0" description="Global PWM Load Control Register">
		<bitfield id="GLD" description="Global Shadow to Active load event control" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GLDMODE" description="Shadow to Active Global Load Pulse Selection" begin="4" end="1" width="4" rwaccess="RW"/>
		<bitfield id="OSHTMODE" description="One Shot Load mode control bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GLDPRD" description="Global Load Strobe Period Select Register" begin="9" end="7" width="3" rwaccess="RW"/>
		<bitfield id="GLDCNT" description="Global Load Strobe Counter Register" begin="12" end="10" width="3" rwaccess="R"/>
	</register>
	<register id="GLDCFG" width="16" page="1" offset="0x35" internal="0" description="Global PWM Load Config Register ">
		<bitfield id="TBPRD_TBPRDHR" description="Global load event configuration for TBPRD:TBPRDHR " begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPA_CMPAHR" description="Global load event configuration for CMPA:CMPAHR " begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPB_CMPBHR" description="Global load event configuration for CMPB:CMPBHR " begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPC" description="Global load event configuration for CMPC " begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPD" description="Global load event configuration for CMPD " begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DBRED_DBREDHR" description="Global load event configuration for DBRED:DBREDHR " begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DBFED_DBFEDHR" description="Global load event configuration for DBFED:DBFEDHR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DBCTL" description="Global load event configuration for DBCTL" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="AQCTLA_AQCTLA2" description="Global load event configuration for AQCTLA/A2 " begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="AQCTLB_AQCTLB2" description="Global load event configuration for AQCTLB/B2 " begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="AQCSFRC" description="Global load event configuration for AQCSFRC " begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="EPWMXLINK" width="32" page="1" offset="0x38" internal="0" description="EPWMx Link Register">
		<bitfield id="TBPRDLINK" description="TBPRD:TBPRDHR  Link " begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="CMPALINK" description="CMPA:CMPAHR Link " begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="CMPBLINK" description="CMPB:CMPBHR Link" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="CMPCLINK" description="CMPC Link" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="CMPDLINK" description="CMPD Link" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GLDCTL2LINK" description="GLDCTL2 Link" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
