IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_epwm_regs.xml
	<register id="DCFWINDOW" width="16" page="1" offset="0xcb" internal="0" description="Digital Compare Filter Window Register">
		<bitfield id="DCFWINDOW" description="Digital Compare Filter Window Register " begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="DCFWINDOWCNT" width="16" page="1" offset="0xcc" internal="0" description="Digital Compare Filter Window Counter Register">
		<bitfield id="DCFWINDOWCNT" description="Digital Compare Filter Window Counter Register " begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="DCCAP" width="16" page="1" offset="0xcf" internal="0" description="Digital Compare Counter Capture Register ">
		<bitfield id="DCCAP" description="Time Base Counter Capture Register" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="DCAHTRIPSEL" width="16" page="1" offset="0xd2" internal="0" description="Digital Compare AH Trip Select ">
		<bitfield id="TRIPINPUT1" description="Trip Input 1 Select to DCAH Mux" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT2" description="Trip Input 2 Select to DCAH Mux" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT3" description="Trip Input 3 Select to DCAH Mux" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT4" description="Trip Input 4 Select to DCAH Mux" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT5" description="Trip Input 5 Select to DCAH Mux" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT6" description="Trip Input 6 Select to DCAH Mux" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT7" description="Trip Input 7 Select to DCAH Mux" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT8" description="Trip Input 8 Select to DCAH Mux" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT9" description="Trip Input 9 Select to DCAH Mux" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT10" description="Trip Input 10 Select to DCAH Mux" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT11" description="Trip Input 11 Select to DCAH Mux" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT12" description="Trip Input 12 Select to DCAH Mux" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT14" description="Trip Input 14 Select to DCAH Mux" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT15" description="Trip Input 15 Select to DCAH Mux" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="DCALTRIPSEL" width="16" page="1" offset="0xd3" internal="0" description="Digital Compare AL Trip Select ">
		<bitfield id="TRIPINPUT1" description="Trip Input 1 Select to DCAL Mux" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT2" description="Trip Input 2 Select to DCAL Mux" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT3" description="Trip Input 3 Select to DCAL Mux" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT4" description="Trip Input 4 Select to DCAL Mux" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT5" description="Trip Input 5 Select to DCAL Mux" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT6" description="Trip Input 6 Select to DCAL Mux" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT7" description="Trip Input 7 Select to DCAL Mux" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT8" description="Trip Input 8 Select to DCAL Mux" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT9" description="Trip Input 9 Select to DCAL Mux" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT10" description="Trip Input 10 Select to DCAL Mux" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT11" description="Trip Input 11 Select to DCAL Mux" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT12" description="Trip Input 12 Select to DCAL Mux" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT14" description="Trip Input 14 Select to DCAL Mux" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT15" description="Trip Input 15 Select to DCAL Mux" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="DCBHTRIPSEL" width="16" page="1" offset="0xd4" internal="0" description="Digital Compare BH Trip Select ">
		<bitfield id="TRIPINPUT1" description="Trip Input 1 Select to DCBH Mux" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT2" description="Trip Input 2 Select to DCBH Mux" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT3" description="Trip Input 3 Select to DCBH Mux" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT4" description="Trip Input 4 Select to DCBH Mux" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT5" description="Trip Input 5 Select to DCBH Mux" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT6" description="Trip Input 6 Select to DCBH Mux" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT7" description="Trip Input 7 Select to DCBH Mux" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT8" description="Trip Input 8 Select to DCBH Mux" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT9" description="Trip Input 9 Select to DCBH Mux" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT10" description="Trip Input 10 Select to DCBH Mux" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT11" description="Trip Input 11 Select to DCBH Mux" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT12" description="Trip Input 12 Select to DCBH Mux" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT14" description="Trip Input 14 Select to DCBH Mux" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT15" description="Trip Input 15 Select to DCBH Mux" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="DCBLTRIPSEL" width="16" page="1" offset="0xd5" internal="0" description="Digital Compare BL Trip Select ">
		<bitfield id="TRIPINPUT1" description="Trip Input 1 Select to DCBL Mux" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT2" description="Trip Input 2 Select to DCBL Mux" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT3" description="Trip Input 3 Select to DCBL Mux" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT4" description="Trip Input 4 Select to DCBL Mux" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT5" description="Trip Input 5 Select to DCBL Mux" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT6" description="Trip Input 6 Select to DCBL Mux" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT7" description="Trip Input 7 Select to DCBL Mux" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT8" description="Trip Input 8 Select to DCBL Mux" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT9" description="Trip Input 9 Select to DCBL Mux" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT10" description="Trip Input 10 Select to DCBL Mux" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT11" description="Trip Input 11 Select to DCBL Mux" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT12" description="Trip Input 12 Select to DCBL Mux" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT14" description="Trip Input 14 Select to DCBL Mux" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="TRIPINPUT15" description="Trip Input 15 Select to DCBL Mux" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="EPWMLOCK" width="32" page="1" offset="0xfa" internal="0" description="EPWM Lock Register">
		<bitfield id="HRLOCK" description="HRPWM Register Set Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GLLOCK" description="Global Load Register Set Lock" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="TZCFGLOCK" description="TripZone Register Set Lock" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="TZCLRLOCK" description="TripZone Clear Register Set Lock" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DCLOCK" description="Digital Compare Register Set Lock" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key to write to this register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="HWVDELVAL" width="16" page="1" offset="0xfd" internal="0" description="Hardware Valley Mode Delay Register">
		<bitfield id="HWVDELVAL" description="Hardware programmed Valley Delay Value" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
	<register id="VCNTVAL" width="16" page="1" offset="0xfe" internal="0" description="Hardware Valley Counter Register">
		<bitfield id="VCNTVAL" description="Valley Counter Value" begin="15" end="0" width="16" rwaccess="R"/>
	</register>
</module>
